app/views/users/edit.html.haml

SELECT "cities".* FROM "cities" LIMIT 1
SELECT "users".* FROM "users" WHERE (email = 'admin@mlip.ru') LIMIT 1
---
      .controls
        = select_tag "user[city_id]", options_from_collection_for_select(City.all, "id", "name"), :prompt => @user.city_id != nil ? @user.city.name : 'выберите город', class: 'span8'