app/views/home/city.html.haml

%table{style: 'margin: 0 auto;'}
  - City.all.each_with_index do |city, index|
---
SELECT "cities".* FROM "cities"