app/views/home/wellcom.html.haml

SELECT "cities".* FROM "cities"
SELECT "areas".* FROM "areas" WHERE "areas"."city_id" = 1
---
%br/
= select("city", "id", City.all.collect {|p| [ p.name, p.id ] }, {:include_blank => true}, html_options = {class: 'chzn-select', :'data-placeholder' => "#{@city == nil ? 'Выберите город' : @city.name}"})
- if @city
  = select("area", "name", @city.areas.collect {|p| [ p.name, p.id ] }, {:include_blank => true}, html_options = {class: 'chzn-select-deselect', :'data-placeholder' => "#{@area == nil ? 'Выберите район' : @city.name}"})

SELECT "products".* FROM "products"
---
  %tbody
    - Product.all.each do |product|