app/views/areas/index.js.erb

SELECT "areas".* FROM "areas"
---
$('#shops .area').html("<%= escape_javascript select('area', 'name', @areas.collect {|p| [ p.name, p.id ] }, {:include_blank => true}, html_options = {class: 'chzn-select-deselect chzn-areas', :'data-placeholder' => 'Выберите район'}) %>");