app/controllers/areas_controller.rb

SELECT "areas".* FROM "areas" WHERE "areas"."city_id" = 1
SELECT "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 1]]
SELECT "areas".* FROM "areas" LIMIT 1
SELECT "cities".* FROM "cities" LIMIT 1
---
  def index
    if params[:city_id]
      @areas = City.find(params[:city_id]).areas
    else
      @areas = Area.all

SELECT "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT 1  [["id", "125"]]
---
  def show
    if params[:id]
      @area = Area.find(params[:id]) || Area.first