app/controllers/chains_controller.rb

SELECT "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "chains".* FROM "chains" WHERE "chains"."id" = ? LIMIT 1  [["id", "6"]]
---
  def show
    if params[:id]
      @area = Area.find(params[:area_id]) if params[:area_id]
      @chain = Chain.find(params[:id]) || Chain.first