app/controllers/home_controller.rb

SELECT "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 1]]
---
  def wellcom
    if params[:city]
      @city = City.find(params[:city]) || City.first