app/controllers/password_resets_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@mlip.ru' LIMIT 1
---
  def create
    if params[:email] == ''
      flash.now.alert = "Неверный адрес электроной почты!"
      render 'new'
    else
      @user = User.find_by_email(params[:email])