app/controllers/shops_controller.rb

  def index
    if params[:area_id] && !params[:chain_id]
      @area = Area.find(params[:area_id])
      #@shops = Shop.where(area_id: @area.id).order('created_at DESC')
      current_user.admin == true ? @shops = Shop.where(area_id: @area.id).order('adds') :  @shops = Shop.where(area_id: @area.id).where(chain_id: current_user.chain.id).order('created_at DESC')
    elsif params[:area_id] && params[:chain_id]
      @area = Area.find(params[:area_id])
      @shops = Shop.where(area_id: @area.id, chain_id: params[:chain_id]).order('adds')
    else
      @area = Area.first
---
SELECT "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT 1  [["id", "152"]]
SELECT "shops".* FROM "shops" WHERE "shops"."area_id" = 151 AND "shops"."chain_id" = 1 ORDER BY created_at DESC
SELECT "chains".* FROM "chains" WHERE "chains"."id" = 1 LIMIT 1
SELECT "user_shops".* FROM "user_shops" WHERE "user_shops"."user_id" = 2
SELECT "areas".* FROM "areas" LIMIT 1
SELECT "chains".* FROM "chains" LIMIT 1

  def create
    if params[:city_id] && params[:area_id] && params[:chain_id] && params[:shop][:adds] != ''
      @area = Area.find(params[:area_id]) if params[:area_id]
      @chain = Chain.find(params[:chain_id]) if params[:chain_id]
      @shop = Shop.create(params[:shop])
      #render 'cities/show'
    elsif params[:shop][:area_id] != '' && params[:shop][:adds] != ''
      @area = Area.find(params[:shop][:area_id])
      @chain = current_user.chain if current_user.seller?
      params[:shop][:chain_id] = @chain.id.to_s
      @shop = Shop.create(params[:shop])
      current_user.admin == true ? @shops = Shop.where(area_id: @area.id).order('created_at DESC') :  @shops = Shop.where(area_id: @area.id).where(chain_id: current_user.chain.id).order('created_at DESC')
---
SELECT "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT 1  [["id", "107"]]
SELECT "chains".* FROM "chains" WHERE "chains"."id" = ? LIMIT 1  [["id", "8"]]
INSERT INTO "shops" ("adds", "area_id", "chain_id", "created_at", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["adds", "hkjhkj"], ["area_id", 106], ["chain_id", 6], ["created_at", Sun, 16 Sep 2012 01:30:32 UTC +00:00], ["phone", nil], ["updated_at", Sun, 16 Sep 2012 01:30:32 UTC +00:00]]
SELECT "shops".* FROM "shops" WHERE "shops"."area_id" = 150 ORDER BY created_at DESC
SELECT "shops".* FROM "shops" WHERE "shops"."area_id" = 123 AND "shops"."chain_id" = 7 ORDER BY created_at DESC

  def update
    if params[:city_id] && params[:area_id] && params[:chain_id] && params[:id]
      @area = Area.find(params[:area_id]) if params[:area_id]
      @chain = Chain.find(params[:chain_id]) if params[:chain_id]
      @shop = Shop.find(params[:id])
      @shop.update_attributes(params[:shop])
---
SELECT "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT 1  [["id", "107"]]
SELECT "chains".* FROM "chains" WHERE "chains"."id" = ? LIMIT 1  [["id", "5"]]
SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", "59"]]
UPDATE "shops" SET "adds" = 'fsdfsdsdfsdf', "updated_at" = '2012-09-16 02:18:20.043836' WHERE "shops"."id" = 59

  def destroy
    if params[:city_id] && params[:area_id] && params[:chain_id] && params[:id]
      @area = Area.find(params[:area_id]) if params[:area_id]
      @chain = Chain.find(params[:chain_id]) if params[:chain_id]
      @shop = Shop.find(params[:id])
      @shop.destroy
      #render 'cities/show'
    elsif params[:city_id] == nil && params[:area_id] && params[:chain_id] == nil && params[:id]
      @shop = Shop.find(params[:id])
      @shop.destroy
      @area = Area.find(params[:area_id])
      current_user.admin == true ? @shops = Shop.where(area_id: @area.id).order('created_at DESC') :  @shops = Shop.where(area_id: @area.id).where(chain_id: current_user.chain.id).order('created_at DESC')
---
SELECT "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT 1  [["id", "107"]]
SELECT "chains".* FROM "chains" WHERE "chains"."id" = ? LIMIT 1  [["id", "5"]]
SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", "58"]]
DELETE FROM "shops" WHERE "shops"."id" = ?  [["id", 58]]
SELECT "shops".* FROM "shops" WHERE "shops"."area_id" = 123 AND "shops"."chain_id" = 7 ORDER BY created_at DESC

  def show
    if params[:id]
      @area = Area.find(params[:area_id]) if params[:area_id]
      @chain = Chain.find(params[:id]) || Chain.first
---
SELECT "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT 1  [["id", "123"]]
SELECT "chains".* FROM "chains" WHERE "chains"."id" = ? LIMIT 1  [["id", "57"]]