app/controllers/shops_controller.rb

SELECT "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 5]]
SELECT "shops".* FROM "shops" WHERE "shops"."chain_id" = 8
---
  def create
    redirect_to edit_user_path if !current_user.admin?

    if params[:shop]
      @city = City.find(params[:city_id])
      @chain = Chain.find(params[:shop][:chain_id])

SELECT "user_shops".* FROM "user_shops" WHERE "user_shops"."user_id" = 2
---
  def destroy
    redirect_to edit_user_path if !current_user.admin?

    if params[:id]
      Shop.find(params[:id]).destroy if current_user.admin?