app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "city_id" = 9, "salt" = 'nFXfYRfDPdYs6thg14z3', "crypted_password" = '$2a$10$O/WJpGFzZbk2wwvlwcmrYe3hj2vd8mI6fDuF3e.s0isXAR3xcC4da', "updated_at" = '2012-09-29 13:24:59.843498' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])
    redirect_to edit_user_path(current_user) if !current_user.admin? && @user != current_user
    if params[:user] && (@user == current_user || current_user.admin?)
      @user.email = params[:user][:email]
      @user.city_id = params[:user][:city_id]
      flash[:info] = "Данные обновлены"
      @user.save