app/controllers/xml_files_controller.rb

SELECT "chains".* FROM "chains" WHERE "chains"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "shops".* FROM "shops" WHERE "shops"."chain_id" = 1
DELETE FROM "shop_products" WHERE "shop_products"."id" = ?  [["id", 1]]
SELECT "products".* FROM "products" WHERE "products"."name" = 'масло' LIMIT 1
INSERT INTO "shop_products" ("created_at", "name", "price", "product_id", "shop_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 03 Oct 2012 08:41:10 UTC +00:00], ["name", "олейна"], ["price", nil], ["product_id", 1], ["shop_id", 93], ["updated_at", Wed, 03 Oct 2012 08:41:10 UTC +00:00]]
SELECT "shop_products".* FROM "shop_products" WHERE "shop_products"."shop_id" = 93
---
  def create
    tmp = params[:xml_file][:attach].tempfile
    file = File.join("public", "#{(0...50).map{ ('a'..'z').to_a[rand(26)] }.join}.xls")
    FileUtils.cp tmp.path, file

    @count = 0

    if params[:xml_file][:chain_id]
      chain = Chain.find(params[:xml_file][:chain_id])
      chain.shops.each do |shop|
        shop.shop_products.destroy_all
      end
      oo = Excel.new(file)
      oo.default_sheet = oo.sheets.first
      2.upto(20) do |line|
        product = oo.cell(line,'A')
        name = oo.cell(line,'B')
        price = oo.cell(line,'C')
        if !name.blank? && !product.blank? && !price.blank? && (prod = Product.find_by_name(product))
          chain.shops.each do |shop|
            ShopProduct.create(shop_id: shop.id, name: name, product_id: prod.id, price: price)
          end
          @count += 1
        end
      end
    elsif params[:xml_file][:shop_id]
      ShopProduct.where(shop_id: params[:xml_file][:shop_id]).destroy_all

INSERT INTO "xml_files" ("attach_content_type", "attach_file_name", "attach_file_size", "attach_updated_at", "created_at", "shop_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
        name = oo.cell(line,'B')
        price = oo.cell(line,'C')
        if !name.blank? && !product.blank? && !price.blank? && (prod = Product.find_by_name(product))
          ShopProduct.create(shop_id: params[:xml_file][:shop_id], name: name, product_id: prod.id, price: price)