app/views/cities/show.html.haml

:javascript
  $(document).ready(function() {
    $('.chzn-select').chosen().change(function() {
      var id = $(this).val();
      document.location.href="/cities/"+id; //http://sravnim-ka.ru
      //alert('sdf')
    });
    $(".chzn-select-deselect").chosen({allow_single_deselect:true}).change(function() {
      var id = $(this).val();
      document.location.href="/cities/#{@city.id}/with_area/"+id#{@chain == nil ? '' : ('with_chain/' + @chain.id.to_s)}; //http://sravnim-ka.ru
    });
    $(".chzn-select-chain").chosen({allow_single_deselect:true}).change(function() {
      var id = $(this).val();
      document.location.href="/cities/#{@city.id}/#{@area == nil ? '' : ('with_area/' + @area.id.to_s)}/with_chain/"+id; //http://sravnim-ka.ru
    });
    $('a').tooltip();
    var shop_list = [];
    $('td.shops').each(function(n, element){
      shop_list.push($(element).attr('id').substr(5));
    });
    $.get("/prices.js", { 'ids[]': shop_list} );
  });
---
INSERT INTO "shops" ("adds", "area_id", "chain_id", "created_at", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["adds", "hkjhkj"], ["area_id", 106], ["chain_id", 6], ["created_at", Sun, 16 Sep 2012 01:30:32 UTC +00:00], ["phone", nil], ["updated_at", Sun, 16 Sep 2012 01:30:32 UTC +00:00]]
SELECT "areas".* FROM "areas" WHERE "areas"."city_id" = 6
SELECT "chains".* FROM "chains"
SELECT "shops".* FROM "shops" WHERE "shops"."area_id" = 111 AND "shops"."chain_id" = 6

  %br/
  = select("city", "id", City.all.collect {|p| [ p.name, p.id ] }, {:include_blank => true}, html_options = {class: 'chzn-select', :'data-placeholder' => "#{@city == nil ? 'Выберите город' : @city.name}"})
---
SELECT "cities".* FROM "cities"